<details><summary>Digger run report at 2024-01-11 09:51:59 (UTC)</summary>
      <details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_ec2</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network2 will be created
  + resource "aws_vpc" "vpc_network2" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network-np2"
        }
      + tags_all                             = {
          + "Name" = "terraform-network-np2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network2: Creating...
aws_vpc.vpc_network2: Creation complete after 1s [id=vpc-0f4040439d6e05330]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>

<details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_vpc</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be created
  + resource "aws_vpc" "vpc_network" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network2"
        }
      + tags_all                             = {
          + "Name" = "terraform-network2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network: Creating...
aws_vpc.vpc_network: Creation complete after 1s [id=vpc-0a25831633a465d14]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>


<details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_np_5455_global_vpc</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be created
  + resource "aws_vpc" "vpc_network" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network-np2"
        }
      + tags_all                             = {
          + "Name" = "terraform-network-np2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network: Creating...
aws_vpc.vpc_network: Creation complete after 1s [id=vpc-07f0cdc7ab5f4997f]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>

</details>